<template>
  <div id="main">
		<div id="nav-mobile">
			<router-link to="/" class="menu-item" :class="[button ? 'menu-mobile-item-show' : 'menu-mobile-item-hidden']">
				<svg xmlns="http://www.w3.org/2000/svg" viewBox="0 -960 960 960">
					<path d="M240-200h147.692v-203.077q0-13.731 9.289-23.019 9.288-9.289 23.019-9.289h120q13.731 0 23.019 9.289 9.289 9.288 9.289 23.019V-200H720v-347.692q0-6.154-2.692-11.154-2.693-5-7.308-8.846L494.615-730q-6.154-5.385-14.615-5.385T465.385-730L250-567.692q-4.615 3.846-7.308 8.846-2.692 5-2.692 11.154V-200Zm-40 0v-347.692q0-15.347 6.865-29.077 6.866-13.731 18.981-22.616l215.385-163.077q16.907-12.923 38.646-12.923 21.738 0 38.892 12.923l215.385 163.077q12.115 8.885 18.981 22.616Q760-563.039 760-547.692V-200q0 16.077-11.961 28.039Q736.077-160 720-160H564.615q-13.73 0-23.019-9.288-9.288-9.289-9.288-23.019v-203.077H427.692v203.077q0 13.73-9.288 23.019Q409.115-160 395.385-160H240q-16.077 0-28.039-11.961Q200-183.923 200-200Zm280-268.462Z"/>
				</svg>
				<span class="menu-mobile-text">Главная</span>
			</router-link>
			<router-link to="/list-article" class="menu-item" :class="[button ? 'menu-mobile-item-show' : 'menu-mobile-item-hidden']">
				<svg xmlns="http://www.w3.org/2000/svg" viewBox="0 -960 960 960">
					<path d="M160-320.379V-650.39q0-27.226 18.981-46.11 18.98-18.885 45.634-18.885h510.77q26.654 0 45.634 18.885Q800-677.616 800-650.39v330.011q0 27.225-18.981 46.11-18.98 18.885-45.634 18.885h-510.77q-26.654 0-45.634-18.885Q160-293.154 160-320.379Zm40-255.006h100v-100h-75.385q-10.769 0-17.692 6.923T200-650.769v75.384Zm140 0h420v-75.384q0-10.77-6.923-17.693-6.923-6.923-17.692-6.923H340v100Zm0 140h420v-100H340v100Zm0 140h395.385q10.769 0 17.692-6.923T760-320v-75.384H340v99.999Zm-115.385 0H300v-99.999H200V-320q0 10.769 6.923 17.692t17.692 6.923Zm-24.615-140h100v-100H200v100Z"/>
				</svg>				
				<span class="menu-mobile-text">Статьи</span>
			</router-link>
			<router-link to="/add-article" class="menu-item" :class="[button ? 'menu-mobile-item-show' : 'menu-mobile-item-hidden']">
				<svg xmlns="http://www.w3.org/2000/svg" viewBox="0 -960 960 960">
					<path d="M480-504.615q-49.5 0-84.75-35.25T360-624.615q0-49.501 35.25-84.751 35.25-35.25 84.75-35.25t84.75 35.25Q600-674.116 600-624.615q0 49.5-35.25 84.75T480-504.615ZM200-256.923v-24.308q0-24.769 14.423-46.346 14.423-21.577 38.808-33.5 56.615-27.154 113.307-40.731Q423.231-415.385 480-415.385q56.769 0 113.462 13.577 56.692 13.577 113.307 40.731 24.385 11.923 38.808 33.5Q760-306 760-281.231v24.308q0 17.616-11.961 29.577-11.962 11.962-29.577 11.962H241.538q-17.615 0-29.577-11.962Q200-239.307 200-256.923Zm40 1.538h480v-25.846q0-13.307-8.577-25-8.577-11.692-23.731-19.769-49.384-23.923-101.836-36.654Q533.405-375.385 480-375.385q-53.405 0-105.856 12.731Q321.692-349.923 272.308-326q-15.154 8.077-23.731 19.769-8.577 11.693-8.577 25v25.846Zm240-289.23q33 0 56.5-23.5t23.5-56.5q0-33-23.5-56.5t-56.5-23.5q-33 0-56.5 23.5t-23.5 56.5q0 33 23.5 56.5t56.5 23.5Zm0-80Zm0 369.23Z"/>
				</svg>
				<span class="menu-mobile-text">Добавить статью</span>
			</router-link>
			<router-link to="/technology-tag" class="menu-item" :class="[button ? 'menu-mobile-item-show' : 'menu-mobile-item-hidden']">
				<svg xmlns="http://www.w3.org/2000/svg" viewBox="0 -960 960 960">
					<path d="M433.461-120q-11.923 0-20.615-8.077-8.692-8.077-10.692-20l-11.231-87.615q-19.154-5.769-41.423-18.154-22.269-12.385-37.885-26.538l-80.077 34.461q-11.692 5.231-23 1.116-11.307-4.116-17.769-14.808l-46.308-80.539q-5.692-10.692-3.461-22.615 2.23-11.923 11.923-19.385l69.615-52.385q-1.769-10.846-2.923-22.346-1.154-11.5-1.154-22.346 0-10.077 1.154-21.192t2.923-25.038l-69.615-52.385q-9.693-7.462-12.308-19.385-2.615-11.923 3.846-22.615l46.308-79q6.462-10.693 17.385-14.808 10.923-4.116 22.615 1.115l80.077 33.693q17.923-14.923 38.769-26.923 20.846-12 40.539-18.539l12-87.615q2-11.923 10.692-20T433.461-840h92.308q11.924 0 21 8.077 9.077 8.077 11.077 20l11.231 88.384q23 8.077 40.654 18.539 17.654 10.461 36.346 26.154l83.154-33.693q11.692-5.231 22.615-1.5 10.923 3.731 17.385 14.423l46.308 79.77q6.461 10.692 3.846 22.615-2.615 11.923-12.308 19.385l-72.692 54.692q3.308 12.385 3.692 22.731.385 10.346.385 20.423 0 9.308-.769 19.654-.77 10.346-3.539 25.038l71.154 53.154q9.692 7.462 12.308 19.385 2.615 11.923-3.846 22.615l-46.308 80.308q-6.462 10.692-17.885 14.539-11.423 3.846-23.115-1.385l-80.385-34.462q-18.692 15.693-37.615 26.923-18.923 11.231-39.385 17.77l-11.231 88.384q-2 11.923-11.077 20-9.076 8.077-21 8.077h-92.308ZM440-160h78.231L533-268.308q30.231-8 54.423-21.961 24.192-13.962 49.269-38.269L736.462-286l39.769-68-87.539-65.769q5-17.077 6.616-31.423 1.615-14.346 1.615-28.808 0-15.231-1.615-28.808-1.616-13.577-6.616-29.884L777.769-606 738-674l-102.077 42.769q-18.154-19.923-47.731-37.346t-55.961-23.115L520-800h-79.769l-12.462 107.538q-30.231 6.462-55.577 20.808-25.346 14.346-50.423 39.423L222-674l-39.769 68L269-541.231q-5 13.462-7 29.231-2 15.769-2 32.769Q260-464 262-449q2 15 6.231 29.231l-86 65.769L222-286l99-42q23.538 23.769 48.885 38.115 25.346 14.347 57.115 22.347L440-160Zm38.923-220q41.846 0 70.923-29.077 29.077-29.077 29.077-70.923 0-41.846-29.077-70.923Q520.769-580 478.923-580q-42.077 0-71.039 29.077-28.961 29.077-28.961 70.923 0 41.846 28.961 70.923Q436.846-380 478.923-380ZM480-480Z"/>
				</svg>
				<span class="menu-mobile-text">Теги</span>
			</router-link>
			<button @click="changeMenuMobileSize">
				<img src="../assets/icons/right-arrow.png" alt="" v-show="!button">
				<img src="../assets/icons/left-arrow.png" alt="" v-show="button">
			</button>
		</div>
		<div id="nav">
			<router-link to="/" class="menu-item">
				<svg xmlns="http://www.w3.org/2000/svg" viewBox="0 -960 960 960">
					<path d="M240-200h147.692v-203.077q0-13.731 9.289-23.019 9.288-9.289 23.019-9.289h120q13.731 0 23.019 9.289 9.289 9.288 9.289 23.019V-200H720v-347.692q0-6.154-2.692-11.154-2.693-5-7.308-8.846L494.615-730q-6.154-5.385-14.615-5.385T465.385-730L250-567.692q-4.615 3.846-7.308 8.846-2.692 5-2.692 11.154V-200Zm-40 0v-347.692q0-15.347 6.865-29.077 6.866-13.731 18.981-22.616l215.385-163.077q16.907-12.923 38.646-12.923 21.738 0 38.892 12.923l215.385 163.077q12.115 8.885 18.981 22.616Q760-563.039 760-547.692V-200q0 16.077-11.961 28.039Q736.077-160 720-160H564.615q-13.73 0-23.019-9.288-9.288-9.289-9.288-23.019v-203.077H427.692v203.077q0 13.73-9.288 23.019Q409.115-160 395.385-160H240q-16.077 0-28.039-11.961Q200-183.923 200-200Zm280-268.462Z"/>
				</svg>
				<span :class="[button ? 'menu-text-show' : 'menu-text-hidden']">Главная</span>
			</router-link>
			<router-link to="/list-article" class="menu-item">
				<svg xmlns="http://www.w3.org/2000/svg" viewBox="0 -960 960 960">
					<path d="M160-320.379V-650.39q0-27.226 18.981-46.11 18.98-18.885 45.634-18.885h510.77q26.654 0 45.634 18.885Q800-677.616 800-650.39v330.011q0 27.225-18.981 46.11-18.98 18.885-45.634 18.885h-510.77q-26.654 0-45.634-18.885Q160-293.154 160-320.379Zm40-255.006h100v-100h-75.385q-10.769 0-17.692 6.923T200-650.769v75.384Zm140 0h420v-75.384q0-10.77-6.923-17.693-6.923-6.923-17.692-6.923H340v100Zm0 140h420v-100H340v100Zm0 140h395.385q10.769 0 17.692-6.923T760-320v-75.384H340v99.999Zm-115.385 0H300v-99.999H200V-320q0 10.769 6.923 17.692t17.692 6.923Zm-24.615-140h100v-100H200v100Z"/>
				</svg>				
				<span :class="[button ? 'menu-text-show' : 'menu-text-hidden']">Статьи</span>
			</router-link>
			<router-link to="/add-article" class="menu-item">
				<svg xmlns="http://www.w3.org/2000/svg" viewBox="0 -960 960 960">
					<path d="M480-504.615q-49.5 0-84.75-35.25T360-624.615q0-49.501 35.25-84.751 35.25-35.25 84.75-35.25t84.75 35.25Q600-674.116 600-624.615q0 49.5-35.25 84.75T480-504.615ZM200-256.923v-24.308q0-24.769 14.423-46.346 14.423-21.577 38.808-33.5 56.615-27.154 113.307-40.731Q423.231-415.385 480-415.385q56.769 0 113.462 13.577 56.692 13.577 113.307 40.731 24.385 11.923 38.808 33.5Q760-306 760-281.231v24.308q0 17.616-11.961 29.577-11.962 11.962-29.577 11.962H241.538q-17.615 0-29.577-11.962Q200-239.307 200-256.923Zm40 1.538h480v-25.846q0-13.307-8.577-25-8.577-11.692-23.731-19.769-49.384-23.923-101.836-36.654Q533.405-375.385 480-375.385q-53.405 0-105.856 12.731Q321.692-349.923 272.308-326q-15.154 8.077-23.731 19.769-8.577 11.693-8.577 25v25.846Zm240-289.23q33 0 56.5-23.5t23.5-56.5q0-33-23.5-56.5t-56.5-23.5q-33 0-56.5 23.5t-23.5 56.5q0 33 23.5 56.5t56.5 23.5Zm0-80Zm0 369.23Z"/>
				</svg>
				<span :class="[button ? 'menu-text-show' : 'menu-text-hidden']">Добавить статью</span>
			</router-link>
			<router-link to="/technology-tag" class="menu-item">
				<svg xmlns="http://www.w3.org/2000/svg" viewBox="0 -960 960 960">
					<path d="M433.461-120q-11.923 0-20.615-8.077-8.692-8.077-10.692-20l-11.231-87.615q-19.154-5.769-41.423-18.154-22.269-12.385-37.885-26.538l-80.077 34.461q-11.692 5.231-23 1.116-11.307-4.116-17.769-14.808l-46.308-80.539q-5.692-10.692-3.461-22.615 2.23-11.923 11.923-19.385l69.615-52.385q-1.769-10.846-2.923-22.346-1.154-11.5-1.154-22.346 0-10.077 1.154-21.192t2.923-25.038l-69.615-52.385q-9.693-7.462-12.308-19.385-2.615-11.923 3.846-22.615l46.308-79q6.462-10.693 17.385-14.808 10.923-4.116 22.615 1.115l80.077 33.693q17.923-14.923 38.769-26.923 20.846-12 40.539-18.539l12-87.615q2-11.923 10.692-20T433.461-840h92.308q11.924 0 21 8.077 9.077 8.077 11.077 20l11.231 88.384q23 8.077 40.654 18.539 17.654 10.461 36.346 26.154l83.154-33.693q11.692-5.231 22.615-1.5 10.923 3.731 17.385 14.423l46.308 79.77q6.461 10.692 3.846 22.615-2.615 11.923-12.308 19.385l-72.692 54.692q3.308 12.385 3.692 22.731.385 10.346.385 20.423 0 9.308-.769 19.654-.77 10.346-3.539 25.038l71.154 53.154q9.692 7.462 12.308 19.385 2.615 11.923-3.846 22.615l-46.308 80.308q-6.462 10.692-17.885 14.539-11.423 3.846-23.115-1.385l-80.385-34.462q-18.692 15.693-37.615 26.923-18.923 11.231-39.385 17.77l-11.231 88.384q-2 11.923-11.077 20-9.076 8.077-21 8.077h-92.308ZM440-160h78.231L533-268.308q30.231-8 54.423-21.961 24.192-13.962 49.269-38.269L736.462-286l39.769-68-87.539-65.769q5-17.077 6.616-31.423 1.615-14.346 1.615-28.808 0-15.231-1.615-28.808-1.616-13.577-6.616-29.884L777.769-606 738-674l-102.077 42.769q-18.154-19.923-47.731-37.346t-55.961-23.115L520-800h-79.769l-12.462 107.538q-30.231 6.462-55.577 20.808-25.346 14.346-50.423 39.423L222-674l-39.769 68L269-541.231q-5 13.462-7 29.231-2 15.769-2 32.769Q260-464 262-449q2 15 6.231 29.231l-86 65.769L222-286l99-42q23.538 23.769 48.885 38.115 25.346 14.347 57.115 22.347L440-160Zm38.923-220q41.846 0 70.923-29.077 29.077-29.077 29.077-70.923 0-41.846-29.077-70.923Q520.769-580 478.923-580q-42.077 0-71.039 29.077-28.961 29.077-28.961 70.923 0 41.846 28.961 70.923Q436.846-380 478.923-380ZM480-480Z"/>
				</svg>
				<span :class="[button ? 'menu-text-show' : 'menu-text-hidden']">Теги</span>
			</router-link>
			<button @click="changeSizeMenu">
				<img src="../assets/icons/right-arrow.png" alt="" v-show="!button">
				<img src="../assets/icons/left-arrow.png" alt="" v-show="button">
			</button>
		</div>
		<div id="nav-clear"></div>
    <router-view/>
  </div>
</template>

<script>
export default {
  name: "Menu",
  data() {
		return {
			menu: true,
			button: false
		}
	},
	methods: {
		changeSizeMenu() {
			this.button = !this.button;
			let nav = document.querySelector('#nav');
			let navClear = document.querySelector('#nav-clear');
			if (nav.style.width === '' || nav.style.width === '70px') {
				nav.style.width = '210px';
				navClear.style.width = '230px';
				return;
			}
			nav.style.width = '70px';
			navClear.style.width = '90px';
		},
		changeMenuMobileSize() {
			this.button = !this.button;
			let navMobile = document.querySelector('#nav-mobile');
			let menuItem = navMobile.querySelectorAll('.menu-item');
			for (let item of menuItem) {
				item.style.opacity = 0;
			}
			if (navMobile.style.width === '' || navMobile.style.width === '50px') {
				navMobile.style.height = '96%';
				navMobile.style.width = '210px';
				setTimeout(function() { // Задержка для появления opacity так как с display: none они перехлестываются
					for (let item of menuItem) { // и накладываются друг на друга и transition не работает. Поэтому нужна
						item.style.opacity = 1; // нужна задержка для opacity
					}
				}, 20);

				return
			}
			navMobile.style.height = '50px';
			navMobile.style.width = '50px';
		},
		isActive(input) {
			return this.$route.path === input;
		}
	}

}
</script>

<style lang="scss" scoped>
// основные цвета
$main-color: #6a6a6a;
$mobile-color: #6a6a6aef;
$main-hover: #5c5c5c;
$yellow: #e9e043;
$orange: #ee8760;
$color-text: #d8dbdf;

// дополнительные цвета
$bgc-mobile-color: #860dd2ef;
$bgc-active-color: #5c5c5c;

#main {
	min-height: 100vh;
	button {
		cursor: pointer;
	}
}
#nav-mobile {
	display: none;
}
#nav{
	display: flex;
	flex-direction: column;
	position: fixed;
	left: 10px;
	top: 2%;
	overflow: scroll;
	background-color: $main-color;
	width: 70px;
	height: 96%;
	transition: width .3s;
	border-radius: 5px;
	scrollbar-width: none;
	z-index: 100;
	img {
		width: 25px;
	}
	button {
		padding-top: 10px;
		margin-top: auto;
		margin-bottom: 10px;
		background-color: transparent;
		border: none;
	}
	&::-webkit-scrollbar {
		width: 0;
	}
}
.menu-item {
	position: relative;
	border-radius: 5px;
	margin: 5px 10px;
	padding: 7px 0px 3px 7px;
	svg {
		width: 36px;
		fill: #000;
	}
	span {
		position: absolute;
		top: 17px;
		font-size: 14px;
		color: black;
	}
	&:hover {
		background-color: $main-hover;
	}
}
.menu-text-show {
	left: 50px;
	transition: left .3s, opacity 1.3s;
}
.menu-text-hidden {
	left: -250px;
	opacity: 0;
	transition: left .3s, opacity .1s;
}
.router-link-exact-active {
	background-color: $bgc-active-color;
	span{
		color: $yellow;
	}
	svg {
		fill: $yellow;
	}
}

#nav-clear {
	width: 90px;
	min-height: 100vh;
	float: left;
	transition: width .3s;
}
.content {
	display: grid;
	min-height: 100vh;
	padding: 10px;
	text-align: center;
}

@media all and (max-width: 600px) {
	#nav {
		display: none;
	}
	#nav-clear {
		display: none;
	}
	#nav-mobile {
		display: flex;
		flex-direction: column;
		position: fixed;
		width: 50px;
		height: 50px;
		left: 10px;
		bottom: 2%;
		background-color: $mobile-color;
		border-radius: 5px;
		transition: height .3s, width .3s;
		z-index: 100;
		img {
			width: 25px;
		}
		button {
			width: 100%;
			padding-bottom: 8px;
			margin-top: auto;
			background-color: transparent;
			border: none;
					}
	}
	.menu-mobile-item-show {
		display: block;
		transition: opacity 1s;
	}
	.menu-mobile-item-hidden {
		display: none;
	}
	.menu-mobile-text {
		left: 50px;
	}
	.router-link-exact-active {
		background-color: $main-color;
		span{
			color: $yellow;
		}
	}
}

</style>